dsdffgh/keildata/STM32/江科大/平衡车/Hardware/MPU6050jkd.c
#include "stm32f10x.h" // Device header
#include "MyI2C.h"
#include "MPU6050_Reg.h"

#define MPU6050_ADDRESS 0xD0 // MPU6050的I2C从机地址

/**
 * 函    数：MPU6050写寄存器
 * 参    数：RegAddress 寄存器地址，范围：参考MPU6050手册的寄存器描述
 * 参    数：Data 要写入寄存器的数据，范围：0x00~0xFF
 * 返 回 值：无
 */
void MPU6050_WriteReg(uint8_t RegAddress, uint8_t Data)
{
	MyI2C_Start();					 // I2C起始
	MyI2C_SendByte(MPU6050_ADDRESS); // 发送从机地址，读写位为0，表示即将写入
	MyI2C_ReceiveAck();				 // 接收应答
	MyI2C_SendByte(RegAddress);		 // 发送寄存器地址
	MyI2C_ReceiveAck();				 // 接收应答
	MyI2C_SendByte(Data);			 // 发送要写入寄存器的数据
	MyI2C_ReceiveAck();				 // 接收应答
	MyI2C_Stop();					 // I2C终止
}

/**
 * 函    数：MPU6050读寄存器
 * 参    数：RegAddress 寄存器地址，范围：参考MPU6050手册的寄存器描述
 * 返 回 值：读取寄存器的数据，范围：0x00~0xFF
 */
uint8_t MPU6050_ReadReg(uint8_t RegAddress)
{
	uint8_t Data;

	MyI2C_Start();					 // I2C起始
	MyI2C_SendByte(MPU6050_ADDRESS); // 发送从机地址，读写位为0，表示即将写入
	MyI2C_ReceiveAck();				 // 接收应答
	MyI2C_SendByte(RegAddress);		 // 发送寄存器地址
	MyI2C_ReceiveAck();				 // 接收应答

	MyI2C_Start();							// I2C重复起始
	MyI2C_SendByte(MPU6050_ADDRESS | 0x01); // 发送从机地址，读写位为1，表示即将读取
	MyI2C_ReceiveAck();						// 接收应答
	Data = MyI2C_ReceiveByte();				// 接收指定寄存器的数据
	MyI2C_SendAck(1);						// 发送应答，给从机非应答，终止从机的数据输出
	MyI2C_Stop();							// I2C终止

	return Data;
}

/**
 * 函    数：MPU6050读取多个寄存器
 * 参    数： Address 器件地址
 * 		  RegAddress 寄存器起始地址，范围：参考MPU6050手册的寄存器描述
 *           Length 要读取的数据长度
 *           pBuffer 存放读取数据的缓冲区指针
 * 返 回 值：0:成功
 */
uint8_t MPU6050_ReadRegs(uint8_t Address, uint8_t RegAddress, uint8_t Length, uint8_t *pBuffer)
{
	MyI2C_Start();					// I2C起始
	MyI2C_SendByte((Address << 1)); // 发送从机地址，读写位为0，表示即将写入
	MyI2C_ReceiveAck();				// 接收应答
	MyI2C_SendByte(RegAddress);		// 发送寄存器起始地址
	if (MyI2C_ReceiveAck())			// 接收应答
	{
		MyI2C_Stop(); // I2C终止
		return 1;
	};

	MyI2C_Start();						   // I2C重复起始
	MyI2C_SendByte((Address << 1) | 0x01); // 发送从机地址，读写位为1，表示即将读取
	MyI2C_ReceiveAck();					   // 接收应答

	for (uint8_t i = 0; i < Length; i++)
	{
		pBuffer[i] = MyI2C_ReceiveByte(); // 接收数据
		if (i != (Length - 1))
		{
			MyI2C_SendAck(0); // 发送应答，继续接收数据
		}
		else
		{
			MyI2C_SendAck(1); // 发送非应答，最后一字节数据后需终止从机的数据输出
		}
	}
	MyI2C_Stop(); // I2C终止
	return 0;
}

/**
 * 函 数：MPU6050写入多个寄存器
 * 参 数：Address 器件地址
 * 参 数：RegAddress 寄存器起始地址，范围：参考MPU6050手册的寄存器描述
 * 参 数：Length 要写入的数据长度
 * 参 数：pBuffer 存放要写入数据的缓冲区指针
 * 返 回 值：写入状态，0表示成功，非0表示失败
 */
uint8_t MPU6050_WriteRegs(uint8_t Address, uint8_t RegAddress, uint8_t Length, const uint8_t *pBuffer) 
{
    MyI2C_Start();                    // I2C起始
    MyI2C_SendByte((Address << 1));   // 发送从机地址，读写位为0，表示即将写入
    if (!MyI2C_ReceiveAck())          // 接收应答
    {
        MyI2C_Stop();                 // 如果接收应答失败，则停止并返回错误
        return 1;
    }

    MyI2C_SendByte(RegAddress);       // 发送寄存器起始地址
    if (!MyI2C_ReceiveAck())          // 接收应答
    {
        MyI2C_Stop();                 // 如果接收应答失败，则停止并返回错误
        return 1;
    }
    
    for (uint8_t i = 0; i < Length; i++) 
    {
        MyI2C_SendByte(pBuffer[i]);   // 发送数据
        if (!MyI2C_ReceiveAck())      // 接收应答
        {
            MyI2C_Stop();             // 如果接收应答失败，则停止并返回错误
            return 1;
        }
    }
    MyI2C_Stop();                     // I2C终止
    return 0;
}

/**
 * 函    数：MPU6050初始化
 * 参    数：无
 * 返 回 值：无
 */
void MPU6050_Init(void)
{
	MyI2C_Init(); // 先初始化底层的I2C

	/*MPU6050寄存器初始化，需要对照MPU6050手册的寄存器描述配置，此处仅配置了部分重要的寄存器*/
	MPU6050_WriteReg(MPU6050_PWR_MGMT_1, 0x01);	  // 电源管理寄存器1，取消睡眠模式，选择时钟源为X轴陀螺仪
	MPU6050_WriteReg(MPU6050_PWR_MGMT_2, 0x00);	  // 电源管理寄存器2，保持默认值0，所有轴均不待机
	MPU6050_WriteReg(MPU6050_SMPLRT_DIV, 0x09);	  // 采样率分频寄存器，配置采样率
	MPU6050_WriteReg(MPU6050_CONFIG, 0x06);		  // 配置寄存器，配置DLPF
	MPU6050_WriteReg(MPU6050_GYRO_CONFIG, 0x18);  // 陀螺仪配置寄存器，选择满量程为±2000°/s
	MPU6050_WriteReg(MPU6050_ACCEL_CONFIG, 0x18); // 加速度计配置寄存器，选择满量程为±16g
}

/**
 * 函    数：MPU6050获取ID号
 * 参    数：无
 * 返 回 值：MPU6050的ID号
 */
uint8_t MPU6050_GetID(void)
{
	return MPU6050_ReadReg(MPU6050_WHO_AM_I); // 返回WHO_AM_I寄存器的值
}

/**
 * 函    数：MPU6050获取数据
 * 参    数：AccX AccY AccZ 加速度计X、Y、Z轴的数据，使用输出参数的形式返回，范围：-32768~32767
 * 参    数：GyroX GyroY GyroZ 陀螺仪X、Y、Z轴的数据，使用输出参数的形式返回，范围：-32768~32767
 * 返 回 值：无
 */
void MPU6050_GetData(int16_t *AccX, int16_t *AccY, int16_t *AccZ,
					 int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ)
{
	uint8_t DataH, DataL; // 定义数据高8位和低8位的变量

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H); // 读取加速度计X轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L); // 读取加速度计X轴的低8位数据
	*AccX = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H); // 读取加速度计Y轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L); // 读取加速度计Y轴的低8位数据
	*AccY = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H); // 读取加速度计Z轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L); // 读取加速度计Z轴的低8位数据
	*AccZ = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_GYRO_XOUT_H); // 读取陀螺仪X轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_XOUT_L); // 读取陀螺仪X轴的低8位数据
	*GyroX = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_GYRO_YOUT_H); // 读取陀螺仪Y轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_YOUT_L); // 读取陀螺仪Y轴的低8位数据
	*GyroY = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H); // 读取陀螺仪Z轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L); // 读取陀螺仪Z轴的低8位数据
	*GyroZ = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回
}

/**
 * 函    数：MPU6050获取角速度
 * 参    数：GyroX GyroY GyroZ 陀螺仪X、Y、Z轴的数据，使用输出参数的形式返回，范围：-32768~32767
 * 返 回 值：无
 */
void MPU6050_GETGyroscope(int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ)
{
	uint8_t DataH, DataL; // 定义数据高8位和低8位的变量

	DataH = MPU6050_ReadReg(MPU6050_GYRO_XOUT_H); // 读取陀螺仪X轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_XOUT_L); // 读取陀螺仪X轴的低8位数据
	*GyroX = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_GYRO_YOUT_H); // 读取陀螺仪Y轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_YOUT_L); // 读取陀螺仪Y轴的低8位数据
	*GyroY = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H); // 读取陀螺仪Z轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L); // 读取陀螺仪Z轴的低8位数据
	*GyroZ = (DataH << 8) | DataL;				  // 数据拼接，通过输出参数返回
}

void MPU6050_GETAccelerometer(int16_t *AccX, int16_t *AccY, int16_t *AccZ)
{
	uint8_t DataH, DataL; // 定义数据高8位和低8位的变量

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H); // 读取加速度计X轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L); // 读取加速度计X轴的低8位数据
	*AccX = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H); // 读取加速度计Y轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L); // 读取加速度计Y轴的低8位数据
	*AccY = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回

	DataH = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H); // 读取加速度计Z轴的高8位数据
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L); // 读取加速度计Z轴的低8位数据
	*AccZ = (DataH << 8) | DataL;				   // 数据拼接，通过输出参数返回
}
